// 1 - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    alert(`Це великий масив, в якому ${friends.length} елементів`)
} else {
    alert('Це маленький масив, в якому менше 3-х елементів')
}

// 2 - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let a = 5;
let b = 10;
let c = 20;
if (a > b && a > c) {
    console.log(a);
} else if (b > a && b > c) {
    console.log(b)
} else {
    console.log(c)
}

// 3 - Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }
let result = (a + b < 4) ? 'Мало' : 'Багато';
console.log(result);

// 4 - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let num = 0;
num = (num > 0) ? 'Позитивне' : (num < 0) ? 'Негативне' : (num === 0) ? 'Нуль' : 'Шляпа';
console.log(num);

// 5 - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test = true;
if (test) {
    console.log('Вірно')
} else {
    console.log('Неправильно')
}

test = (test) ? 'Вірно' : 'Неправильно';
console.log(test);

// 6 - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
let quiz = prompt('Яка «офіційна» назва JavaScript?')
if (quiz === 'ECMAScript') {
    alert('Правильно!')
} else {
    alert('Не знаєте? ECMAScript!')
}

// 7 - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let flatNumber = prompt('Select a number of flat');
if (flatNumber > 0 && flatNumber <= 20) {
    alert('First entrance')
} else if (flatNumber > 20 && flatNumber <= 48) {
    alert('Second entrance')
} else if (flatNumber > 48 && flatNumber <= 90) {
    alert('Third entrance')
} else {
    alert('Wrong building!')
}

// 8 - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО
let number = +prompt('Type some number');
if (number === 10) {
    alert('You are right!')
} else {
    alert('You are wrong!')
}

// 9 - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let temperature = prompt('Яка температура повітря?');
if (temperature >= 10 && temperature <= 22) {
    alert('Йдемо вчитися!')
} else {
    alert('Сидимо вдома!')
}

// 10  - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let rand = +prompt('Вибери число від 1 до 5');
switch (rand) {
    case 1:
        alert('Авто');
        break;
    case 2:
        alert('Мото');
        break;
    case 3:
        alert('Телефон');
        break;
    case 4:
        alert('Ноутбук');
        break;
    case 5:
        alert('Планшет');
        break;
    default:
        alert('Nothing');
}
